package HomeWork10.Middle.Autopark;
/*
Создайте свой автопарк

В вашем автопарке множество машин, которые можно сдать в аренду. У каждой машины есть год выпуска и пробег.
Все машины не старше 20 лет и у всех машин пробег не больше 10 000 км. Каждая марка автомобиля имеет свой
коэффициент от 1 до 10, например Жигули — 1, BMW — 8, Porsсhe —10. Когда нужно посчитать сумму за аренду,
нужно рассчитывать по следующей формуле:

СУММА = ((10 000 - пробег) * (20 - возраст авто) * коэффициент * время аренды) / 1000

Задача: создать классы автомобилей и каждому классу присвоить свой коэффициент.

Создать экземпляры классов данных автомобилей, передать в конструктор параметры пробега и возраст
автомобиля. Калькулятор должен выводить стоимость аренды автомобиля за час.
 */
public class Auto {
}
