package HomeWork9.Easy;

public class Easy {
   /* Вопросы:

    Дайте определение понятиям: инкапсуляция, модификатор доступа.
    Какие модификаторы доступа есть в java? Какие уровни доступа они имеют?
    Могут ли классы быть private? Приведите пример использования такого класса.
    Может ли конструктор быть private? Приведите пример использования такого конструктора.
    Почему в интерфейсах нельзя использовать private и protected модификаторы?
    Что такое default метод у интерфейса? Для чего нужен default?

    */
}
