package HomeWork8.Middle.Third;
/*
Калькулятор домашних тренировок.
Калькулятор тренировок должен уметь подсчитывать количество потерянных калорий во время тренировок.
Имеется множество видов физических упражнений — класс Exercises: например, бег, прыжки на скакалке, плаванье и т.д.
У родительского класса Exercises должен быть абстрактный метод подсчёта калорий за минуту. Каждый объект класса
Exercises имеет собственную реализацию подсчёта. Калькулятор должен получить тип упражнения и время, которое было
затрачено на упражнение (в минутах), и посчитать количество потраченных калорий.
 */

public class MiddleThird {
}
