package HomeWork11.Hard;

public class Hard {
    /*
    Симметричная разность двух строк.

Симметрическая разность - Википедия

Например:

На вход подаётся два множества {1, 5, 7} и {1, 6, 8} на выходе разность равна {5, 7}


Реализуйте проверку на правильную скобочную последовательность.

Правильная скобочная последовательность — это правильная совокупность открывающихся и закрывающихся скобок. Например:

[ { () } ] - правильно

[ [ { ] } ] - неправильно

На вход подается скобочная последовательность, на выходе ответ — правильная или неправильная последовательность.

Подсказка: для решения этой задачи познакомьтесь с такой структурой данных как стек (Stack).


Реализация собственного LinkedList и ArrayList

Создайте собственную реализацию классов LinkedList и ArrayList с методами add(element), get(index), remove(index). Помните, что ArrayList основан на массиве, а LinkedList — связный список. Общие методы можете вынести в абстрактный класс.
     */
}
