package HomeWork11.Middle;

public class Middle {
    /*
   “Частота слов в тексте”
На вход подаётся некий текст, на выходе должно быть слово и частота его появления в тексте. Например:
“ Идут три брата: брат Клим брит, брат Глеб брит, брат Игнат бородат.”
брат [3]
брит [2]
бородат [1]
Клим [1]
брата [1]
Игнат [1]
Идут [1]
три [1]
Глеб [1]
Подсказка: чтобы разбить сроку на массив, используйте метод класса String split(DELIMITER), который вернёт массив строк.
Используйте для решения задачи коллекции.

“Уникальные числа”
Вводится n целых чисел. Определите, сколько различных чисел было введено.
Например: 1 3 3 5 6 7 7 7 8
Ответ: 6
Используйте для решения задачи коллекции.

Какое слово встречается чаще всего?
На вход подаётся текст, например отрывок из книги “Война и Мир”
Нужно определить, какое слово появляется в тексте чаще всего. Используйте для решения задачи коллекции.


Олимпиада.
Вам нужно написать последовательный выход стран на открытии Олимпийских игр по алфавиту. Нужно учесть, что Греция всегда выходит первой.
На вход: неотсортированный список стран (Япония, Канада, Россия и т.д.)
На выходе: Греция, Австралия, Австрия ….. Япония
Подсказка: используйте для этого Comparable
     */
}
